UT_Marketplaces.Marketplaces/src/Enums/СтатусыПересчетовТоваров/СтатусыПересчетовТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ae6099f7-97fe-4eb1-88a6-b8d701fbeefd">
  <name>СтатусыПересчетовТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="adbdecd7-7147-4c89-9207-2c1d3c562caa">
    <name>ВнесениеРезультатов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7a6d2cd1-f59e-4f36-aee8-0dfbe3127c2e">
    <name>Выполнено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_СтатусыДокументовВТСД/рар_мп_СтатусыДокументовВТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_СтатусыДокументовВТСД</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="4dec627e-3939-4191-a213-0cea734fc86c">
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a606d3e5-4a59-4b2c-9d3d-5976f5c778cf">
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76156fda-6b2e-4da7-871d-49dfc4840df3">
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26f7ed56-e5e4-4c71-a8a4-5c47b91bcf78">
    <name>ВводОстатковСобственныхТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="03a32901-2610-422f-9525-c29f974696fe">
    <name>ВводОстатковПрочихАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="48a11946-4d50-41a7-919b-49bf18403be5">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9b0356bb-5966-4577-ab5a-bbc09ae9323b">
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Documents/ПересчетТоваров/ПересчетТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="852cd565-1094-4515-9352-2ed625a00830">
  <name>ПересчетТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="67d1d1a0-9e83-4a14-ab8a-949ae4af5f41">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45f2c666-e47a-4c2b-9a1c-de93847332ae">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="8eab6973-9074-4141-ad3b-d91d6c861d9f">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="19c80eb0-2224-4e36-b2ac-dcf1f4a258d0">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="17ce58d7-d2f2-4855-88c3-b178fdf5994a">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7f6ff30a-d9d2-4105-8e02-cd6161d1c70d">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9b90b186-075a-4781-a817-9ae0666a8fb7">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f5795aea-1b51-494e-8e1b-3f8afb0aa2e5">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="08db1ca5-b860-45b0-b1f5-f8274e584c81">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7249ca2f-170a-4a4e-b746-13ecec31a7e9">
      <name>КоличествоФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ceef4a2-6b58-45a0-8a75-bb6e3004590f">
  <name>ЗаказКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>рар_мп_АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="872dcece-786c-416e-bfa4-4ce98df56dd6">
    <name>НомерПоДаннымКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>рар_мп_ЯндексМаркет_СтатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_ЯндексМаркет_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ЯндексМаркет_ПодстатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_ЯндексМаркет_ПодстатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_УникальныйИдентификаторСклада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Wildberries_СтатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Wildberries_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Wildberries_СтатусОбработкиЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Wildberries_СтатусыОбработкиЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Ozon_СтатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Ozon_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Ozon_ПодстатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Ozon_ПодстатусыЗаказов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d462888a-fa46-4e10-842a-8647c5c2ab42">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="21767e3f-5e9d-43d3-803c-eaf6279e10db">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>рар_мп_СтатусДокументаВТСД</name>
    <type>
      <types>EnumRef.рар_мп_СтатусыДокументовВТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ПользовательТСД</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>рар_мп_ТоварыДляМаркировки</name>
    <attributes>
      <name>рар_мп_СтрокаИзТЧТовары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_IDТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЗаполнениеМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Exemplar_Id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЧестныйЗнак</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЗаполнениеГТД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7b526229-3286-418a-920a-ff15a9b3ec48">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="da473af6-1960-4683-b941-b8e3988be4fb">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ea68fa0a-5188-4f2e-b04a-9834dbc8adaa">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89c8c32c-ef8a-46f1-a7b4-75b2e1524d3f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/Documents/ПриобретениеТоваровУслуг/ПриобретениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5e0d9dd9-464c-4fa3-984a-2a2da8517f38">
  <name>ПриобретениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="941aa10e-3657-48ec-8f9d-92e38e90ecbf">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6b535f05-ac01-4fbe-a57c-0c88609787de">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07770f6f-1b6b-4728-8b1e-5727c63dbf6d">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="58fc47c6-1733-47b4-bc71-2472a7a3d39b">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8bd9f000-83c9-4a48-8166-2691b6f02183">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="dcee393b-d797-4bfd-be64-3bc288149128">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8a5b2ff1-9253-46ce-be3f-1ffa9c7e158e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cb0a36d3-0331-490e-8517-3a0e0836c9e0">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="690a0f93-be8f-4a32-8881-57f1d122fbb8">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8852b0c5-f552-486c-868f-ebe8ca0b962f">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e44fc5-c457-46f7-a2c2-f7d09f0be16f">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="680ae0ca-e1f8-48ba-b136-aaa160965f42">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/CommonModules/РаботаСДокументами/Module.bsl
Процедура ПолучитьДанныеДокументаПересчетТоваров(Документ, Результат) Экспорт
	ЕстьЯчейки = Ложь;
	ЕстьСерии = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПересчетТоваровТовары.Ячейка КАК Ячейка,
	|	ПересчетТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПересчетТоваровТовары.Характеристика КАК Характеристика,
	|	ПересчетТоваровТовары.Серия КАК Серия,
	|	ПересчетТоваровТовары.КоличествоУпаковок КАК Количество,
	|	ПересчетТоваровТовары.Номенклатура.ЕдиницаИзмерения КАК УпаковкаНоменклатуры, 
	|	ПересчетТоваровТовары.Упаковка КАК Упаковка
	|ИЗ
	|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
	|ГДЕ
	|	ПересчетТоваровТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	
	РезультатЗапроса.Колонки.Добавить("ШтрихкодЯчейки", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("ШтрихкодСерии", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("НоменклатураСДанными");
	
	Для Каждого Строка Из РезультатЗапроса Цикл
		Если ЗначениеЗаполнено(Строка.Ячейка) Тогда
			Строка.ШтрихкодЯчейки = РаботаСШтрихкодами.ПолучитьШК(Строка.Ячейка);
			ЕстьЯчейки = Истина;
		Иначе
			Строка.ШтрихкодЯчейки = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Серия) Тогда
			Строка.ШтрихкодСерии = РаботаСШтрихкодами.ПолучитьШК(Строка.Серия);
			ЕстьСерии = Истина;
		Иначе
			Строка.ШтрихкодСерии = "";
		КонецЕсли;
		Строка.НоменклатураСДанными = РаботаСоСправочниками.ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре(Строка.Номенклатура);
		Если Не ЗначениеЗаполнено(Строка.Упаковка) Тогда
			Строка.Упаковка = Строка.УпаковкаНоменклатуры;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Вставить("Номер", Документ.Номер);
	Результат.Вставить("Дата", Документ.Дата);
	Результат.Вставить("ТаблицаТоваров", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса));				
	Результат.Вставить("ЕстьЯчейки", ЕстьЯчейки);
	Результат.Вставить("ЕстьСерии", ЕстьСерии);
	Результат.Вставить("ГУИД", Документ.УникальныйИдентификатор()); 
	Результат.Вставить("Склад", Документ.Склад.Наименование); 
	Результат.Вставить("Ответственный", Документ.Ответственный.Наименование);
КонецПроцедуры

Функция ЗаписатьПересчетТоваров(ДокументИзМП) Экспорт
	Документ = Документы.ПересчетТоваров.ПолучитьСсылку(ДокументИзМП.ГУИД).ПолучитьОбъект();
	ТЧДокументаБазы = Документ.Товары;
	ТЧДокументаМП = ДокументИзМП.Товары; 
	
	КоличествоСтрокДокаБазы = ТЧДокументаБазы.Количество();
	КоличествоСтрокДокаМП = ТЧДокументаМП.Количество();
	
	Документ.Статус = Перечисления.СтатусыПересчетовТоваров.Выполнено;
	
	Если КоличествоСтрокДокаБазы = КоличествоСтрокДокаМП Тогда
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоФакт = Строка.КоличествоФакт;
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоУпаковокФакт = Строка.КоличествоФакт;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоФакт = Строка.КоличествоФакт;
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоУпаковокФакт = Строка.КоличествоФакт;
			Если Строка.НомерСтроки = КоличествоСтрокДокаБазы Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Для Сч = КоличествоСтрокДокаБазы По КоличествоСтрокДокаМП - 1 Цикл
			НоваяСтрокаТЧ = ТЧДокументаБазы.Добавить(); 
			НоваяСтрокаТЧ.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(ТЧДокументаМП[Сч].Номенклатура);
			Если ЗначениеЗаполнено(ТЧДокументаМП[Сч].Ячейка) Тогда
				НоваяСтрокаТЧ.Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(ТЧДокументаМП[Сч].Ячейка);
			КонецЕсли;
			Если ЗначениеЗаполнено(ТЧДокументаМП[Сч].Упаковка) Тогда
				НоваяСтрокаТЧ.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(ТЧДокументаМП[Сч].Упаковка);
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ТЧДокументаМП[Сч].Характеристика) Тогда
				НоваяСтрокаТЧ.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ТЧДокументаМП[Сч].Характеристика);
			КонецЕсли;				
			НоваяСтрокаТЧ.КоличествоФакт = ТЧДокументаМП[Сч].КоличествоФакт; 
			НоваяСтрокаТЧ.КоличествоУпаковокФакт = ТЧДокументаМП[Сч].КоличествоФакт;
		КонецЦикла;
	КонецЕсли;
	
	//Документ.Записать(РежимЗаписиДокумента.Проведение);
	Документ.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Документ;
КонецФункции

Функция ЗаписатьЗаказКлиента(ДокументИзМП) Экспорт
	Документ = Документы.ЗаказКлиента.ПолучитьСсылку(ДокументИзМП.ГУИД).ПолучитьОбъект();
	
	ТЧДокументаБазы = Документ.рар_мп_ТоварыДляМаркировки;
	ТЧДокументаМП = ДокументИзМП.ТоварыДляМаркировки; 
	РеквизитЧестногоЗнача = "рар_мп_ЧестныйЗнак";
	
	КоличествоСтрокДокаБазы = ТЧДокументаБазы.Количество();
	КоличествоСтрокДокаМП = ТЧДокументаМП.Количество();
	
	Документ.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Завершен;
	
	Если КоличествоСтрокДокаБазы = КоличествоСтрокДокаМП Тогда
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1][РеквизитЧестногоЗнача] = 
				Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСсылку(Строка.ЧестныйЗнак);
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1][РеквизитЧестногоЗнача] = Строка.ЧестныйЗнак;
			Если Строка.НомерСтроки = КоличествоСтрокДокаБазы Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Для Сч = КоличествоСтрокДокаБазы По КоличествоСтрокДокаМП - 1 Цикл
			НоваяСтрокаТЧ = ТЧДокументаБазы.Добавить(); 
			НоваяСтрокаТЧ.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(ТЧДокументаМП[Сч].Номенклатура);
			НоваяСтрокаТЧ[РеквизитЧестногоЗнача] = ТЧДокументаМП[Сч].ЧестныйЗнак;
			НоваяСтрокаТЧ.рар_мп_Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ТЧДокументаМП[Сч].Характеристика);
		КонецЦикла;
	КонецЕсли;
	
	Документ.ДополнительныеСвойства.Вставить("ЗвершениеДокументаИзТСД", Истина); 
	
	//Документ.Записать(РежимЗаписиДокумента.Проведение);
	Документ.Записать(РежимЗаписиДокумента.Запись);
КонецФункции

Функция ЗаписатьРеестрЗаказов(ДокументИзМП) Экспорт
	Документ = Документы.рар_мп_РеестрЗаказов.ПолучитьСсылку(ДокументИзМП.ГУИД).ПолучитьОбъект();
	ПользовательТСД = Справочники.Пользователи.ПолучитьСсылку(ДокументИзМП.ГУИДПользователя);
	
	ТЧДокументаБазы = Документ.рар_мп_МаркируемыеТовары;
	ТЧДокументаМП = ДокументИзМП.ТоварыИзЗаказов;
	РеквизитЧестногоЗнача = "рар_мп_ЧестныйЗнак";

	КоличествоСтрокДокаБазы = ТЧДокументаБазы.Количество();
	КоличествоСтрокДокаМП = ТЧДокументаМП.Количество();
	
	Документ.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Завершен;
	
	Если КоличествоСтрокДокаБазы = КоличествоСтрокДокаМП Тогда
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1][РеквизитЧестногоЗнача] = 
				Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСсылку(Строка.ЧестныйЗнак);
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1][РеквизитЧестногоЗнача] = Строка.ЧестныйЗнак;
			Если Строка.НомерСтроки = КоличествоСтрокДокаБазы Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Для Сч = КоличествоСтрокДокаБазы По КоличествоСтрокДокаМП - 1 Цикл
			НоваяСтрокаТЧ = ТЧДокументаБазы.Добавить(); 
			НоваяСтрокаТЧ.рар_мп_Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(ТЧДокументаМП[Сч].Номенклатура);
			НоваяСтрокаТЧ[РеквизитЧестногоЗнача] = ТЧДокументаМП[Сч].ЧестныйЗнак;
			НоваяСтрокаТЧ.рар_мп_Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ТЧДокументаМП[Сч].Характеристика);
		КонецЦикла;
	КонецЕсли;
	
	Документ.ДополнительныеСвойства.Вставить("ЗвершениеДокументаИзТСД", Истина); 

	//Документ.Записать(РежимЗаписиДокумента.Проведение);
	Документ.Записать(РежимЗаписиДокумента.Запись);
	
	ЗавершитьСвязанныеСРеестромЗаказыКлиента(Документ.Ссылка, ПользовательТСД);
КонецФункции

Процедура ЗавершитьСвязанныеСРеестромЗаказыКлиента(РеестрЗаказаСсылка, ПользовательТСД)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	рар_мп_РеестрЗаказоврар_мп_ЗаказыИзМаркетплейса.рар_мп_Заказ КАК ЗаказКлиента
		|ИЗ
		|	Документ.рар_мп_РеестрЗаказов.рар_мп_ЗаказыИзМаркетплейса КАК рар_мп_РеестрЗаказоврар_мп_ЗаказыИзМаркетплейса
		|ГДЕ
		|	рар_мп_РеестрЗаказоврар_мп_ЗаказыИзМаркетплейса.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", РеестрЗаказаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаказКлиентаОбъект = Выборка.ЗаказКлиента.ПолучитьОбъект();
		ЗаказКлиентаОбъект.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Завершен;
		ЗаказКлиентаОбъект.рар_мп_ПользовательТСД = ПользовательТСД;
		
		ЗаказКлиентаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект)
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	
КонецПроцедуры

Функция СоздатьПриобретениеТоваровИУслуг(Данные) Экспорт
	
	НовыйДок = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	
	ЗаказСсылка = Документы.ЗаказПоставщику.ПолучитьСсылку(Данные.ЗаказПоставщику);
	НовыйДок.Дата = ТекущаяДатаСеанса();
	НовыйДок.Организация = Справочники.Организации.ПолучитьСсылку(Данные.Организация);
	НовыйДок.УстановитьНовыйНомер();	
	
	Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.Склад));	
	
	Если ЗначениеЗаполнено(ЗаказСсылка) Тогда 
		НовыйДок.Заполнить(ЗаказСсылка);
		
		Для Каждого Строка Из Данные.Товары Цикл
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
			Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
			Отбор = Новый Структура("Номенклатура, Характеристика", Номенклатура, Характеристика);
			МассивСтрок = НовыйДок.Товары.НайтиСтроки(Отбор);
			Если МассивСтрок.Количество() = 0 Тогда 
				Продолжить;  
			ИначеЕсли Строка.КоличествоФакт <= 0 Тогда
				НовыйДок.Товары.Удалить(МассивСтрок[0]);
				Продолжить;
			КонецЕсли;			
			ИзменяемаяСтрока = МассивСтрок[0];
			ИзменяемаяСтрока.Количество = Строка.КоличествоФакт;
			ИзменяемаяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
			ИзменяемаяСтрока.ЗаказПоставщику = ЗаказСсылка;
			ИзменяемаяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
			
			СтрокаЗаказа = ЗаказСсылка.Товары.НайтиСтроки(Отбор)[0];
			ИзменяемаяСтрока.КодСтроки = СтрокаЗаказа.КодСтроки;
			
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, НовыйДок);	
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ОбработатьСтрокуТЧ(ИзменяемаяСтрока, СтруктураДействий, Неопределено);
		КонецЦикла;
	Иначе
		НовыйДок.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
		НовыйДок.Склад = Справочники.Склады.ПолучитьСсылку(Данные.Склад);
		
		НовыйДок.Менеджер = Справочники.Пользователи.ПолучитьСсылку(Данные.Автор);
		
		Для Каждого Строка Из Данные.Товары Цикл 
			НоваяСтрока = НовыйДок.Товары.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
			НоваяСтрока.Количество = Строка.КоличествоФакт;
			НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
			НоваяСтрока.Склад = Склад;
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
		КонецЦикла;
	КонецЕсли;
	
	НовыйДок.Записать();
	
	Возврат НовыйДок.Ссылка;	
	
КонецФункции

Функция СоздатьРеализациюТоваровИУслуг(Данные) Экспорт
	
	НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	
	Склад = Справочники.Склады.ПолучитьСсылку(Данные.Склад);
	
	ЗаказСсылка = Документы.ЗаказКлиента.ПолучитьСсылку(Данные.ЗаказКлиента);
	Если ЗначениеЗаполнено(ЗаказСсылка) Тогда 
		НовыйДок.Заполнить(ЗаказСсылка);
		Для Каждого Строка Из Данные.Товары Цикл 
			Если Строка.КоличествоФакт > 0 Тогда 
				Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
				Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);				
				НоваяСтрока = НовыйДок.Товары.Добавить();
				НоваяСтрока.Номенклатура = Номенклатура;
				НоваяСтрока.Характеристика = Характеристика;
				НоваяСтрока.Количество = Строка.КоличествоФакт;
				НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
				НоваяСтрока.Склад = Склад;
				НоваяСтрока.ЗаказКлиента = ЗаказСсылка;
				НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
				
				Отбор = Новый Структура("Номенклатура, Характеристика", Номенклатура, Характеристика);
				МассивСтрок = ЗаказСсылка.Товары.НайтиСтроки(Отбор);
				Если МассивСтрок.Количество() > 0 Тогда 
					НоваяСтрока.Цена = МассивСтрок[0].Цена;
					НоваяСтрока.СтавкаНДС = МассивСтрок[0].СтавкаНДС;
					НоваяСтрока.ВидЦены = МассивСтрок[0].ВидЦены;
					НоваяСтрока.КодСтроки = МассивСтрок[0].КодСтроки;
					
					СтруктураДействий = Новый Структура;
					ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, НовыйДок);	
					ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;		
	Иначе 
		Для Каждого Строка Из Данные.Товары Цикл 
			НоваяСтрока = НовыйДок.Товары.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
			НоваяСтрока.Количество = Строка.КоличествоФакт;
			НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
			НоваяСтрока.Склад = Склад;
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
		КонецЦикла;	
	КонецЕсли;	
	
	НовыйДок.Дата = ТекущаяДатаСеанса();
	НовыйДок.Организация = Справочники.Организации.ПолучитьСсылку(Данные.Организация);
	НовыйДок.УстановитьНовыйНомер();
	
	НовыйДок.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	НовыйДок.Склад = Склад;
	
	НовыйДок.Менеджер = Справочники.Пользователи.ПолучитьСсылку(Данные.Автор);
	
	НовыйДок.Записать();
	
	Возврат НовыйДок.Ссылка;	
	
КонецФункции

Функция СоздатьПриходныйОрдер(Данные) Экспорт
	
	НовыйДок = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса();
	НовыйДок.УстановитьНовыйНомер();
	
	НовыйДок.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;
	НовыйДок.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	НовыйДок.Склад = Справочники.Склады.ПолучитьСсылку(Данные.Склад);
	НовыйДок.Статус = Перечисления.СтатусыПриходныхОрдеров.КПоступлению;		
	НовыйДок.Распоряжение = ПолучитьСсылкуДокумента(Данные.Распоряжение);	
	ОтветственныйИсполнитель = Справочники.Пользователи.ПолучитьСсылку(Данные.Автор);
	НовыйДок.Ответственный = ОтветственныйИсполнитель;
	НовыйДок.Исполнитель = ОтветственныйИсполнитель;
	
	Для Каждого Строка Из Данные.Товары Цикл 
		НоваяСтрока = НовыйДок.Товары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		НоваяСтрока.Количество = Строка.КоличествоФакт;
		НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;   
		НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
	КонецЦикла;
	
	НовыйДок.Записать();
	
	Возврат НовыйДок.Ссылка;	
	
КонецФункции

Функция СоздатьРасходныйОрдер(Данные) Экспорт
	
	НовыйДок = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДатаСеанса();
	НовыйДок.УстановитьНовыйНомер();
	
	НовыйДок.ДатаОтгрузки = ТекущаяДатаСеанса();
	НовыйДок.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(Неопределено);
	НовыйДок.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаКлиенту;
	//НовыйДок.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	НовыйДок.Склад = Справочники.Склады.ПолучитьСсылку(Данные.Склад);
	НовыйДок.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен;
	Распоряжение = ПолучитьСсылкуДокумента(Данные.Распоряжение);
	НовыйДок.Получатель = Распоряжение.Партнер;
	ОтветственныйИсполнитель = Справочники.Пользователи.ПолучитьСсылку(Данные.Автор);
	НовыйДок.Ответственный = ОтветственныйИсполнитель;
	НовыйДок.Контролер = ОтветственныйИсполнитель;
	
	Для Каждого Строка Из Данные.Товары Цикл 
		НоваяСтрока = НовыйДок.ОтгружаемыеТовары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		НоваяСтрока.Количество = Строка.КоличествоФакт;
        НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
		НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
		
		НоваяСтрока = НовыйДок.ТоварыПоРаспоряжениям.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		НоваяСтрока.Количество = Строка.КоличествоФакт;
		НоваяСтрока.Распоряжение = Распоряжение;
	КонецЦикла;
	
	НовыйДок.Записать();
	
	Возврат НовыйДок.Ссылка;	
	
КонецФункции
 
Функция СоздатьПеремещениеТоваров(Данные, Пользователь) Экспорт
	НовыйДокумент = Документы.ПеремещениеТоваров.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.Организация = Данные.Организация;
	НовыйДокумент.УстановитьНовыйНомер();
	
	НовыйДокумент.СкладОтправитель = Данные.СкладОтправитель;
	НовыйДокумент.СкладПолучатель = Данные.СкладПолучатель;
	НовыйДокумент.ЗаказНаПеремещение = Данные.ЗаказНаПеремещение;
	НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	НовыйДокумент.Ответственный = Пользователь;
	НовыйДокумент.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	НовыйДокумент.ПеремещениеПоЗаказам = Истина;
	НовыйДокумент.ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров;
	НовыйДокумент.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	
	Для Каждого Строка Из Данные.Товары Цикл
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Характеристика = Строка.Характеристика;
		НоваяСтрока.Упаковка = Строка.Упаковка;
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.КоличествоУпаковок = Строка.Количество;
		НоваяСтрока.ЗаказНаПеремещение = Данные.ЗаказНаПеремещение; 
	КонецЦикла;
	
	НовыйДокумент.Записать();
	
	Возврат НовыйДокумент.Ссылка;
КонецФункции

Функция СоздатьПеремещениеТоваровНаОсновеЗаказаНаПеремещения(ГУИДПользователя, Документ, Результат) Экспорт
	Пользователь = Справочники.Пользователи.ПолучитьСсылку(ГУИДПользователя);
	ДанныеДокумента = Новый Структура("Организация, СкладОтправитель, СкладПолучатель, ЗаказНаПеремещение, Товары", Документ.Организация, Документ.СкладОтправитель, Документ.СкладПолучатель, Документ.Ссылка, Документ.Товары); 
	НовыйДокументПеремещенияТоваров = РаботаСДокументами.СоздатьПеремещениеТоваров(ДанныеДокумента, Пользователь); 
	РаботаСДокументами.ПолучитьДанныеДокументаПеремещениеТоваров(НовыйДокументПеремещенияТоваров, Результат);
	Результат.Вставить("Организация", ДанныеДокумента.Организация.УникальныйИдентификатор());
	Результат.Вставить("СкладОтправитель", ДанныеДокумента.СкладОтправитель.УникальныйИдентификатор());
	Результат.Вставить("СкладПолучатель", ДанныеДокумента.СкладПолучатель.УникальныйИдентификатор());
	Результат.Вставить("ЗаказНаПеремещение", ДанныеДокумента.ЗаказНаПеремещение.УникальныйИдентификатор());
КонецФункции

Процедура ПолучитьДанныеДокументаПеремещениеТоваров(Документ, Результат) Экспорт
	ЕстьСерии = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.Характеристика КАК Характеристика,
	|	ПеремещениеТоваровТовары.Серия КАК Серия,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок КАК Количество,
	|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения КАК УпаковкаНоменклатуры, 
	|	ПеремещениеТоваровТовары.Упаковка КАК Упаковка
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	РезультатЗапроса =Запрос.Выполнить().Выгрузить();
	
	РезультатЗапроса.Колонки.Добавить("ШтрихкодСерии", Новый ОписаниеТипов("Строка"));
	РезультатЗапроса.Колонки.Добавить("НоменклатураСДанными");
	Для Каждого Строка Из РезультатЗапроса Цикл
		Если ЗначениеЗаполнено(Строка.Серия) Тогда
			Строка.ШтрихкодСерии = РаботаСШтрихкодами.ПолучитьШК(Строка.Серия);
			ЕстьСерии = Истина;
		Иначе
			Строка.ШтрихкодСерии = "";
		КонецЕсли;   
		Строка.НоменклатураСДанными = РаботаСоСправочниками.ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре(Строка.Номенклатура);
		Если Не ЗначениеЗаполнено(Строка.Упаковка) Тогда
			Строка.Упаковка = Строка.УпаковкаНоменклатуры;
		КонецЕсли;
	КонецЦикла; 
		
	Результат.Вставить("Номер", Документ.Номер);
	Результат.Вставить("Дата", Документ.Дата);
	Результат.Вставить("ТаблицаТоваров", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса));			
	Результат.Вставить("ЕстьСерии", ЕстьСерии);
	Результат.Вставить("ГУИД", Документ.УникальныйИдентификатор());
	Результат.Вставить("Организация", Документ.Организация.УникальныйИдентификатор());
	Результат.Вставить("СкладОтправитель", Документ.СкладОтправитель.УникальныйИдентификатор());
	Результат.Вставить("СкладПолучатель", Документ.СкладПолучатель.УникальныйИдентификатор());
	Результат.Вставить("ЗаказНаПеремещение", Неопределено);
КонецПроцедуры

Функция ЗаписатьПеремещениеТоваров(ДокументИзМП) Экспорт
	Документ = Документы.ПеремещениеТоваров.ПолучитьСсылку(ДокументИзМП.ГУИД).ПолучитьОбъект();
	ТЧДокументаБазы = Документ.Товары;
	ТЧДокументаМП = ДокументИзМП.Товары; 
	
	КоличествоСтрокДокаБазы = ТЧДокументаБазы.Количество();
	КоличествоСтрокДокаМП = ТЧДокументаМП.Количество();
	
	Если КоличествоСтрокДокаБазы = КоличествоСтрокДокаМП Тогда  
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1].Количество = Строка.КоличествоФакт;
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоУпаковок = Строка.КоличествоФакт;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ТЧДокументаМП Цикл 
			ТЧДокументаБазы[Строка.НомерСтроки-1].Количество = Строка.КоличествоФакт;
			ТЧДокументаБазы[Строка.НомерСтроки-1].КоличествоУпаковок = Строка.КоличествоФакт;
			Если Строка.НомерСтроки = КоличествоСтрокДокаБазы Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для Сч = КоличествоСтрокДокаБазы По КоличествоСтрокДокаМП - 1 Цикл
			НоваяСтрока = Документ.Товары.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(ТЧДокументаМП[Сч].Номенклатура);
			Если ЗначениеЗаполнено(ТЧДокументаМП[Сч].Упаковка) Тогда
				НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(ТЧДокументаМП[Сч].Упаковка);
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ТЧДокументаМП[Сч].Характеристика) Тогда
				НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ТЧДокументаМП[Сч].Характеристика);
			КонецЕсли;
			
			НоваяСтрока.Количество = ТЧДокументаМП[Сч].КоличествоФакт;
			НоваяСтрока.КоличествоУпаковок = ТЧДокументаМП[Сч].КоличествоФакт;			
		КонецЦикла;
	КонецЕсли;
	
	//Документ.Записать(РежимЗаписиДокумента.Проведение);
	Документ.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Документ;
	
КонецФункции 

Функция ЗаписатьПеремещениеТоваровСозданноговМП(ДокументИзМП, Пользователь) Экспорт
	НовыйДокумент = Документы.ПеремещениеТоваров.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	НовыйДокумент.УстановитьНовыйНомер("ТСД");
	НовыйДокумент.Организация = Справочники.Организации.ПолучитьСсылку(ДокументИзМП.Организация);
	НовыйДокумент.СкладОтправитель = Справочники.Склады.ПолучитьСсылку(ДокументИзМП.СкладОтправитель);
	НовыйДокумент.СкладПолучатель = Справочники.Склады.ПолучитьСсылку(ДокументИзМП.СкладПолучатель);
	НовыйДокумент.Ответственный = Пользователь;
	НовыйДокумент.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	НовыйДокумент.ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
	НовыйДокумент.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	
	ТЧДокумента = ДокументИзМП.Товары;
	Для Каждого Строка Из ДокументИзМП.Товары Цикл
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
		//НоваяСтрока.Серия = Справочники.Организации.ПолучитьСсылку(ДокументИзМП.Серия);
		НоваяСтрока.Количество = Строка.КоличествоФакт;
		НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
	КонецЦикла;
	
	//НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
КонецФункции

Функция ЗаписатьРазмещениеТоваровСозданноговМП(ДокументИзМП, Пользователь) Экспорт
	НовыйДокумент = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Размещение;
	НовыйДокумент.УстановитьНовыйНомер();
	НовыйДокумент.Склад = Справочники.Склады.ПолучитьСсылку(ДокументИзМП.Склад);
	НовыйДокумент.Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(ДокументИзМП.Помещение);
	НовыйДокумент.ЗонаПриемки = Справочники.СкладскиеЯчейки.ПолучитьСсылку(ДокументИзМП.ЗонаПриемки);
	НовыйДокумент.Ответственный = Пользователь;
	НовыйДокумент.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВРаботе;
	
	ТЧДокумента = ДокументИзМП.Товары;
	Для Каждого Строка Из ДокументИзМП.Товары Цикл
		НоваяСтрока = НовыйДокумент.ТоварыРазмещение.Добавить();
		НоваяСтрока.Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Строка.Ячейка);
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		Если ЗначениеЗаполнено(Строка.Характеристика) Тогда
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Упаковка) Тогда	
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Строка.Упаковка);
		КонецЕсли;
		//НоваяСтрока.Серия = Справочники.Организации.ПолучитьСсылку(ДокументИзМП.Серия);
		НоваяСтрока.Количество = Строка.КоличествоФакт;
		НоваяСтрока.КоличествоУпаковок = Строка.КоличествоФакт;
	КонецЦикла;
	
	//НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
КонецФункции

Функция НайтиДокументыПоНомеру(Номер, ВидДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Дата КАК Дата,
	|	Представление(ЗаказКлиента.Склад) КАК Склад
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Номер = &Номер
	|%Условие";
	
	Запрос.УстановитьПараметр("Номер", Номер);

	Если ВидДокумента = "ПересчетТоваров" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Условие", "И ЗаказКлиента.Статус = Значение(Перечисление.СтатусыПересчетовТоваров.ВРаботе)");
	ИначеЕсли ВидДокумента = "ПеремещениеТоваров" ИЛИ ВидДокумента = "ЗаказНаПеремещение" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Представление(ЗаказКлиента.Склад) КАК Склад", "Представление(ЗаказКлиента.СкладОтправитель) КАК СкладОтправитель, Представление(ЗаказКлиента.СкладПолучатель) КАК СкладПолучатель");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Условие", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Условие", "");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказКлиента", ВидДокумента);
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Колонки.Добавить("ГУИД");
	Для Каждого Стр Из РезультатЗапроса Цикл 
		Стр.ГУИД = Строка(Стр.Ссылка.УникальныйИдентификатор());	
	КонецЦикла;
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		Возврат РезультатЗапроса;
	КонецЕсли;	
	
КонецФункции 

Функция ПолучитьДанныеДокументаОснованияПриемкиОтгрузки(Ссылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК УпаковкаНоменклатуры,
	|	ЗаказКлиентаТовары.Упаковка КАК ЕдиницаИзмерения,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК Количество
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказКлиента", Ссылка.Метаданные().Имя);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТЧТовары = Запрос.Выполнить().Выгрузить();
	
	ТЧТовары.Колонки.Добавить("НоменклатураСДанными");

	Для Каждого Стр Из ТЧТовары Цикл 
		Стр.НоменклатураСДанными = РаботаСоСправочниками.ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре(Стр.Номенклатура);
		Если Не ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			Стр.ЕдиницаИзмерения = Стр.УпаковкаНоменклатуры;
		КонецЕсли;
	КонецЦикла;  
		
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Номер", Ссылка.Номер);
	ДанныеДокумента.Вставить("Дата", Ссылка.Дата);
	ДанныеДокумента.Вставить("ГУИД", Ссылка.УникальныйИдентификатор());
	ДанныеДокумента.Вставить("Организация", Ссылка.Организация.УникальныйИдентификатор());
	ДанныеДокумента.Вставить("Склад", Ссылка.Склад.УникальныйИдентификатор());
	ДанныеДокумента.Вставить("Партнер", Строка(Ссылка.Партнер));
	ДанныеДокумента.Вставить("Контрагент", Строка(Ссылка.Контрагент));
	ДанныеДокумента.Вставить("Товары", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЧТовары));	
	
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ПолучитьМассивВозможныхДокументовПриемки(ДокументОснование) Экспорт
		
	МассивТиповДокументов = Новый Массив;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
		Если Константы.ИспользоватьСтатусыЗаказовПоставщикам.Получить() 
			И НЕ ДокументОснование.Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден Тогда 
			Возврат МассивТиповДокументов;
		КонецЕсли;			
		Если ДокументОснование.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда 
			ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
			
			Если ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным
				ИЛИ ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.ПоДоговорамПослеЗаказовИлиНакладных Тогда 
				МассивТиповДокументов.Добавить("ПриобретениеТоваровУслуг");
				МассивТиповДокументов.Добавить("ПриходныйОрдерНаТовары");
			Иначе 
				МассивТиповДокументов.Добавить("ПриобретениеТоваровУслуг");
			КонецЕсли;
		Иначе 
			МассивТиповДокументов.Добавить("ПриобретениеТоваровУслуг");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Если ДокументОснование.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда 
			Если НЕ ЗначениеЗаполнено(ДокументОснование.ЗаказПоставщику) Тогда 
				МассивТиповДокументов.Добавить("ПриходныйОрдерНаТовары");
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат МассивТиповДокументов;
	
КонецФункции // ПолучитьМассивВозможныхДокументовПриемки()

Функция ПолучитьСсылкуДокумента(ГУИД)
	
	Ссылка = Документы.ЗаказПоставщику.ПолучитьСсылку(ГУИД);		
	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено Тогда 		
		Ссылка = Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку(ГУИД);
	Иначе 
		Возврат Ссылка;
	КонецЕсли;
	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено Тогда 		
		Ссылка = Документы.ЗаказКлиента.ПолучитьСсылку(ГУИД);
	Иначе 
		Возврат Ссылка;
	КонецЕсли;
	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено Тогда 		
		Ссылка = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(ГУИД);
	Иначе 
		Возврат Ссылка;
	КонецЕсли;	
	
	Возврат Ссылка;
	
КонецФункции // ПолучитьСсылкуДокумента()

Функция РаботаСДокументомРазмещения(Параметры)Экспорт
КонецФункции

Функция ПолучитьМассивВозможныхДокументовОтгрузки(ДокументОснование) Экспорт
	
	МассивТиповДокументов = Новый Массив;		
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
		Если НЕ ДокументОснование.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке И 
			НЕ ДокументОснование.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда 
			Возврат МассивТиповДокументов;
		КонецЕсли;
		Отгрузить = Перечисления.ВариантыОбеспечения.Отгрузить;
		ПодходящиеДокументы = ДокументОснование.Товары.Найти(Отгрузить, "ВариантОбеспечения");
		Если ПодходящиеДокументы = Неопределено Тогда 
			Возврат МассивТиповДокументов;
		КонецЕсли;
		
		Если ДокументОснование.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда			 
				МассивТиповДокументов.Добавить("РеализацияТоваровУслуг");
				МассивТиповДокументов.Добавить("РасходныйОрдерНаТовары");			
		Иначе 
			МассивТиповДокументов.Добавить("РеализацияТоваровУслуг");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если ДокументОснование.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда 
			Если НЕ ЗначениеЗаполнено(ДокументОснование.ЗаказКлиента) Тогда 
				МассивТиповДокументов.Добавить("РасходныйОрдерНаТовары");
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	Возврат МассивТиповДокументов;	
	
КонецФункции

Функция ВзятьВРаботуЗаказКлиента(Параметры) Экспорт 
	Результат = Новый Структура("Успешно, Сообщение", Истина, "");
	Документ = Документы.ЗаказКлиента.ПолучитьСсылку(Параметры.ГУИДЗаказаКлиента); 
	ПользовательТСД = Справочники.Пользователи.ПолучитьСсылку(Параметры.ГУИДПользователя);
	Если Документ.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Новый Тогда
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументОбъект.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.ВРаботе;
		ДокументОбъект.рар_мп_ПользовательТСД = ПользовательТСД;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ВзятиеДокументаВРаботуИзТСД", Истина);
		ДокументОбъект.Записать();
	Иначе
		Результат.Успешно = Ложь;
		Результат.Сообщение = "Документ уже в работе!";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции 

Функция ВзятьВРаботуРеестрЗаказов(Параметры) Экспорт 
	Результат = Новый Структура("Успешно, Сообщение", Истина, "");
	Документ = Документы.рар_мп_РеестрЗаказов.ПолучитьСсылку(Параметры.ГУИДРеестраЗаказов); 
	ПользовательТСД = Справочники.Пользователи.ПолучитьСсылку(Параметры.ГУИДПользователя);
	Если Документ.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.Новый Тогда
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументОбъект.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.ВРаботе;
		ДокументОбъект.рар_мп_ПользовательТСД = ПользовательТСД;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ВзятиеДокументаВРаботуИзТСД", Истина);
		ДокументОбъект.Записать();
	Иначе
		Результат.Успешно = Ложь;
		Результат.Сообщение = "Документ уже в работе!";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура ЗарегистрироватьКОбменуПриОчисткеСтатуса(ДокументОбъект) Экспорт
	Если ДокументОбъект.рар_мп_СтатусДокументаВТСД = Перечисления.рар_мп_СтатусыДокументовВТСД.ПустаяСсылка() Тогда
		Если СтатусДокументаВТСДБылДругим(ДокументОбъект.Ссылка, ДокументОбъект.рар_мп_СтатусДокументаВТСД) Тогда
			ДокументОбъект.ДополнительныеСвойства.Вставить("ЗарегистрироватьДокументКОбменуНаТСД", Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

Функция СтатусДокументаВТСДБылДругим(ДокументСсылка, СтатусДокументаВТСД)
	
	НаименованиеДокумента = ДокументСсылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка
		|	И ЗаказКлиента.рар_мп_СтатусДокументаВТСД <> &рар_мп_СтатусДокументаВТСД
		|	И ЗаказКлиента.рар_мп_СтатусДокументаВТСД <> &СтатусЗавершен";
	
	Запрос.УстановитьПараметр("рар_мп_СтатусДокументаВТСД", СтатусДокументаВТСД);
	Запрос.УстановитьПараметр("СтатусЗавершен", Перечисления.рар_мп_СтатусыДокументовВТСД.Завершен);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ЗаказКлиента", "Документ." + НаименованиеДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;

КонецФункции
